; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared2 - mode
	infrared1 - mode
	image5 - mode
	thermograph0 - mode
	image3 - mode
	infrared4 - mode
	Star1 - direction
	Star5 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Star11 - direction
	GroundStation12 - direction
	Star0 - direction
	GroundStation13 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Star7 - direction
	GroundStation2 - direction
	Star3 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star7)
	(supports instrument1 image3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph0)
	(supports instrument2 image3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
	(supports instrument3 infrared1)
	(supports instrument3 image3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star7)
	(supports instrument4 image5)
	(supports instrument4 infrared2)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite1 Planet14)
	(have_image Planet14 image5)
	(have_image Star15 infrared1)
	(have_image Planet16 infrared1)
	(have_image Planet17 infrared4)
	(have_image Planet17 infrared2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
2. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 6
3. (turn_to satellite1 planet14 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet14)
   goals met: 1 of 6
4. (turn_to satellite1 planet16 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet16)
   goals met: 0 of 6
5. (take_image satellite1 planet16 instrument3 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 1 of 6
6. (turn_to satellite1 planet14 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet14)
   goals met: 2 of 6
7. (turn_to satellite1 star15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star15)
   goals met: 1 of 6
8. (take_image satellite1 star15 instrument3 infrared1)
   added: (have_image star15 infrared1)
   goals met: 2 of 6
9. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 2 of 6
10. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 6
11. (turn_to satellite1 planet14 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 planet14)
   goals met: 3 of 6
12. (turn_to satellite1 star3 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star3)
   goals met: 2 of 6
13. (calibrate satellite1 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 2 of 6
14. (turn_to satellite1 planet14 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet14)
   goals met: 3 of 6
15. (take_image satellite1 planet14 instrument4 image5)
   added: (have_image planet14 image5)
   goals met: 4 of 6
16. (turn_to satellite1 planet17 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet17)
   goals met: 3 of 6
17. (take_image satellite1 planet17 instrument4 infrared2)
   added: (have_image planet17 infrared2)
   goals met: 4 of 6
18. (take_image satellite1 planet17 instrument4 infrared4)
   added: (have_image planet17 infrared4)
   goals met: 5 of 6
19. (turn_to satellite1 planet14 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet14)
   goals met: 6 of 6
